In [1]:
import pandas as pd

In [3]:
df1 = pd.read_csv("../../data/database_files/pre_2002_data.csv")

columns=['post_code','purchase_price','contract_date','year','area']
df1=df1[columns]
df1.head()

   post_code  purchase_price contract_date  year   area
0       2046          182000    19/10/1990  1990    0.0
1       2046          371000    13/12/1990  1990  622.0
2       2046          302000    31/05/1990  1990  546.0
3       2325          180000    29/06/1990  1990    3.0
4       2176          205000    23/11/1990  1990  717.0

In [4]:
df2 = pd.read_csv("../../data/database_files/post_2021_data.csv")
df2=df2[columns]
df2.head()

   post_code  purchase_price contract_date  year     area
0       2795          357500    23/08/2002  2002    8.433
1       2787          104000    31/07/2002  2002   41.700
2       2787          218000    15/08/2002  2002      NaN
3       2787          110000    27/08/2002  2002  947.200
4       2787          185000    20/05/2002  2002      NaN

In [6]:
df_final = pd.concat([df1,df2])
df_final.head()

   post_code  purchase_price contract_date  year   area
0       2046          182000    19/10/1990  1990    0.0
1       2046          371000    13/12/1990  1990  622.0
2       2046          302000    31/05/1990  1990  546.0
3       2325          180000    29/06/1990  1990    3.0
4       2176          205000    23/11/1990  1990  717.0

In [8]:
df_final["contract_date"]=pd.to_datetime(df_final["contract_date"])

/var/folders/74/9tpvyg253_d1_06tsh3c83900000gn/T/ipykernel_84755/2522285298.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df_final["contract_date"]=pd.to_datetime(df_final["contract_date"])

In [ ]:
df_final.dtypes